In [25]:
import json

employees = []

with open('1.txt', 'r') as f:
    for line in f:
        d = {}
        list = line.strip("\n").split(",")  
        d['name'] =list[0]
        d['salary']=list[1]
        family=list[2]
        fam=family.split(";")
        d['subordinates']=fam
        earn={}
        earn[list[3]]=list[4]
        earn[list[5]]=list[6]
        earn[list[7]]=list[8]
        d['deductions']=earn
        add={}
        add['street']=list[9]
        add['city']=list[10]
        add['state']=list[11]
        add['zip']=list[12]
        d['address']=add
        print(d)

with open('employees.json', 'w') as f:
    jas = json.dumps(d)
    f.write(jas)

FileNotFoundError: [Errno 2] No such file or directory: '1.txt'

In [145]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [146]:
import pymysql 
pymysql.install_as_MySQLdb()
%sql mysql://stu2000013095:stu2000013095@162.105.146.37:43306

'Connected: stu2000013095@None'

In [147]:
%sql use stu2000013095;

 * mysql://stu2000013095:***@162.105.146.37:43306
0 rows affected.

[]

In [148]:
%sql show processlist;

 * mysql://stu2000013095:***@162.105.146.37:43306
2 rows affected.

[(7600, 'stu2000013095', '10.129.223.234:51194', 'stu2000013095', 'Sleep', 1, '', None),
 (7969, 'stu2000013095', '10.129.223.234:63055', 'stu2000013095', 'Query', 0, 'init', 'show processlist')]

In [149]:
%sql kill 7598

 * mysql://stu2000013095:***@162.105.146.37:43306
(pymysql.err.OperationalError) (1094, 'Unknown thread id: 7598')
[SQL: kill 7598]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [150]:
%%sql
drop table if exists employees;
set @@foreign_key_checks=0;
create table  employees ( 
    id  int  primary key auto_increment, 
    info  json );

set @@foreign_key_checks=1;

 * mysql://stu2000013095:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [151]:
%%sql
delete from employees;

insert into  employees(info)  values (
    '{"name"\:"John Doe","salary"\:100000.0, "subordinates" \:["Mary Smith", "Todd Jones"],"deductions"\:{"Federal_Taxes"\:"0.2","State_Taxes"\:"0.05", "Insurance"\:"0.1"},"address"\:{"street"\:"1 Michigan Ave.","city"\:"Chicago", "state"\:"IL", "zip"\:"60601"}}' );
insert into  employees(info)  values (
    '{"name"\:"Mary Smith","salary"\:80000.0, "subordinates" \:["Bill King"],"deductions"\:{"Federal Taxes"\:"0.2","State Taxes "\:"0.05", "Insurance"\:"0.1"},"address"\:{"street"\:"100 Ontario St.","city"\:"Chicago", "state"\:"IL", "zip"\:"60600"}}' );
insert into  employees(info)  values (
    '{"name"\:"Todd Jones","salary"\:70000.0, "deductions"\:{"Federal Taxes"\:"0.15","State Taxes "\:"0.03", "Insurance"\:"0.1"},"address"\:{"street"\:"200 Chicago Ave.","city"\:"Oak Park", "state"\:"IL", "zip"\:"60700"}}' );
insert into  employees(info)  values (
    '{"name"\:"Bill King","salary"\:60000.0, "deductions"\:{"Federal Taxes"\:"0.15","State Taxes "\:"0.03", "Insurance"\:"0.1"},"address"\:{"street"\:"300 Obscure Dr.","city"\:"Obscuria", "state"\:"IL", "zip"\:"60100"}}' );
insert into  employees(info)  values (
    '{"name"\:"Boss Man","salary"\:200000.0, "subordinates" \:["John Doe", "Fred Finance"],"deductions"\:{"Federal Taxes"\:"0.3","State Taxes "\:"0.07", "Insurance"\:"0.05"},"address"\:{"street"\:"Pretentious Drive.","city"\:"Chicago", "state"\:"IL", "zip"\:"60500"}}' );
insert into  employees(info)  values (
    '{"name"\:"Fred Finance","salary"\:150000.0, "subordinates" \:["Stacy Accountant"],"deductions"\:{"Federal Taxes"\:"0.3","State Taxes "\:"0.07", "Insurance"\:"0.05"},"address"\:{"street"\:"Pretentious Drive.","city"\:"Chicago", "state"\:"IL", "zip"\:"60500"}}' );
insert into  employees(info)  values (
    '{"name"\:"Stacy Accountant","salary"\:60000.0, "subordinates" \:["Mary Smith", "Todd Jones"],"deductions"\:{"Federal Taxes"\:"0.15","State Taxes "\:"0.03", "Insurance"\:"0.1"},"address"\:{"street"\:"300 Main St.","city"\:"Naperville", "state"\:"IL", "zip"\:"60563"}}' );

 * mysql://stu2000013095:***@162.105.146.37:43306
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

操作2：基于上面的employees表，定义5个的查询，使用JSON_EXTRACT或者JSON_SEARCH完成。

In [152]:
%%sql
desc employees;
select * from employees;

 * mysql://stu2000013095:***@162.105.146.37:43306
2 rows affected.
7 rows affected.

[(1, '{"name": "John Doe", "salary": 100000.0, "address": {"zip": "60601", "city": "Chicago", "state": "IL", "street": "1 Michigan Ave."}, "deductions": {"Insurance": "0.1", "State_Taxes": "0.05", "Federal_Taxes": "0.2"}, "subordinates": ["Mary Smith", "Todd Jones"]}'),
 (2, '{"name": "Mary Smith", "salary": 80000.0, "address": {"zip": "60600", "city": "Chicago", "state": "IL", "street": "100 Ontario St."}, "deductions": {"Insurance": "0.1", "State Taxes ": "0.05", "Federal Taxes": "0.2"}, "subordinates": ["Bill King"]}'),
 (3, '{"name": "Todd Jones", "salary": 70000.0, "address": {"zip": "60700", "city": "Oak Park", "state": "IL", "street": "200 Chicago Ave."}, "deductions": {"Insurance": "0.1", "State Taxes ": "0.03", "Federal Taxes": "0.15"}}'),
 (4, '{"name": "Bill King", "salary": 60000.0, "address": {"zip": "60100", "city": "Obscuria", "state": "IL", "street": "300 Obscure Dr."}, "deductions": {"Insurance": "0.1", "State Taxes ": "0.03", "Federal Taxes": "0.15"}}'),
 (5, '{"name": "Boss Man", "salary": 200000.0, "address": {"zip": "60500", "city": "Chicago", "state": "IL", "street": "Pretentious Drive."}, "deductions": {"Insurance": "0.05", "State Taxes ": "0.07", "Federal Taxes": "0.3"}, "subordinates": ["John Doe", "Fred Finance"]}'),
 (6, '{"name": "Fred Finance", "salary": 150000.0, "address": {"zip": "60500", "city": "Chicago", "state": "IL", "street": "Pretentious Drive."}, "deductions": {"Insurance": "0.05", "State Taxes ": "0.07", "Federal Taxes": "0.3"}, "subordinates": ["Stacy Accountant"]}'),
 (7, '{"name": "Stacy Accountant", "salary": 60000.0, "address": {"zip": "60563", "city": "Naperville", "state": "IL", "street": "300 Main St."}, "deductions": {"Insurance": "0.1", "State Taxes ": "0.03", "Federal Taxes": "0.15"}, "subordinates": ["Mary Smith", "Todd Jones"]}')]

In [153]:
%%sql
# 查询给定员工对应的地址编号
select json_extract(info,'$.address.zip') from employees where json_extract(info,'$.name') = 'John Doe';

 * mysql://stu2000013095:***@162.105.146.37:43306
1 rows affected.

[('"60601"',)]

In [154]:
%%sql
# 查询给定员工的实际收入（扣除税收等）
select json_extract(info,'$.salary')*(1-json_extract(info,'$.deductions.Insurance')-json_extract(info,'$.deductions.State_Taxes')-json_extract(info,'$.deductions.Federal_Taxes')) from employees where json_extract(info,'$.name') = 'John Doe';

 * mysql://stu2000013095:***@162.105.146.37:43306
1 rows affected.

[(64999.99999999999,)]

In [155]:
%%sql
# 查询Chicago对应的路径
select json_search(info,'all','Chicago') from employees

 * mysql://stu2000013095:***@162.105.146.37:43306
7 rows affected.

[('"$.address.city"',),
 ('"$.address.city"',),
 (None,),
 (None,),
 ('"$.address.city"',),
 ('"$.address.city"',),
 (None,)]

In [156]:
%%sql
# 查询给定员工的上级员工及其工资
select json_extract(info, '$.subordinates') as subordinates,
       json_extract(info, '$.salary') as subordinate_salary
from employees,
     json_table(info, '$.subordinates[*]' columns (
         subordinate VARCHAR(100) path '$'
     )) as sub
where sub.subordinate = 'John Doe';

 * mysql://stu2000013095:***@162.105.146.37:43306
1 rows affected.

[('["John Doe", "Fred Finance"]', '200000.0')]

In [157]:
%%sql
# 查询和某位员工来自同一个城市的员工姓名
select json_extract(info, '$.name') as employee_name, json_extract(info, '$.address.city') as city
from employees
where json_extract(info, '$.address.city') = (
    select json_extract(info, '$.address.city')
    from employees
    where json_extract(info, '$.name') = 'John Doe'
)
and json_extract(info, '$.name') != 'John Doe';

 * mysql://stu2000013095:***@162.105.146.37:43306
3 rows affected.

[('"Mary Smith"', '"Chicago"'),
 ('"Boss Man"', '"Chicago"'),
 ('"Fred Finance"', '"Chicago"')]

操作3：将上面的employees表展开成1NF的平面表，新的平面表的属性为
(name, salary,	subordinates, Federal Taxes, State Taxes, Insurance, street, city, state, zip)

In [158]:
%%sql
drop table if exists employees_flat;
create table employees_flat (
  name VARCHAR(100),
  salary DECIMAL(10, 2),
  subordinates JSON,
  Federal_Taxes DECIMAL(10, 2),
  State_Taxes DECIMAL(10, 2),
  Insurance DECIMAL(10, 2),
  street VARCHAR(100),
  city VARCHAR(100),
  state VARCHAR(100),
  zip VARCHAR(10)
);

 * mysql://stu2000013095:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

In [159]:
%%sql
insert into employees_flat (name, salary, subordinates, Federal_Taxes, State_Taxes, Insurance, street, city, state, zip)
select
  json_extract(info, '$.name'),
  json_extract(info, '$.salary'),
  json_extract(info, '$.subordinates'),
  json_extract(info, '$.deductions.Federal_Taxes'),
  json_extract(info, '$.deductions.State_Taxes'),
  json_extract(info, '$.deductions.Insurance'),
  json_extract(info, '$.address.street'),
  json_extract(info, '$.address.city'),
  json_extract(info, '$.address.state'),
  json_extract(info, '$.address.zip')
from employees;

 * mysql://stu2000013095:***@162.105.146.37:43306
7 rows affected.

[]

In [160]:
%%sql
desc employees_flat;
select * from employees_flat;

 * mysql://stu2000013095:***@162.105.146.37:43306
10 rows affected.
7 rows affected.

[('"John Doe"', Decimal('100000.00'), '["Mary Smith", "Todd Jones"]', Decimal('0.20'), Decimal('0.05'), Decimal('0.10'), '"1 Michigan Ave."', '"Chicago"', '"IL"', '"60601"'),
 ('"Mary Smith"', Decimal('80000.00'), '["Bill King"]', None, None, Decimal('0.10'), '"100 Ontario St."', '"Chicago"', '"IL"', '"60600"'),
 ('"Todd Jones"', Decimal('70000.00'), None, None, None, Decimal('0.10'), '"200 Chicago Ave."', '"Oak Park"', '"IL"', '"60700"'),
 ('"Bill King"', Decimal('60000.00'), None, None, None, Decimal('0.10'), '"300 Obscure Dr."', '"Obscuria"', '"IL"', '"60100"'),
 ('"Boss Man"', Decimal('200000.00'), '["John Doe", "Fred Finance"]', None, None, Decimal('0.05'), '"Pretentious Drive."', '"Chicago"', '"IL"', '"60500"'),
 ('"Fred Finance"', Decimal('150000.00'), '["Stacy Accountant"]', None, None, Decimal('0.05'), '"Pretentious Drive."', '"Chicago"', '"IL"', '"60500"'),
 ('"Stacy Accountant"', Decimal('60000.00'), '["Mary Smith", "Todd Jones"]', None, None, Decimal('0.10'), '"300 Main St."', '"Naperville"', '"IL"', '"60563"')]

操作4：对下面的Assembly表，使用递归查询，生成树形结构，再将它输出如下的JSON数据：[trike[wheel[spoke, tire[rim, tube]], frame[seat, pedal]]]

In [161]:
%%sql
drop table if exists assembly;
CREATE TABLE assembly (
  part VARCHAR(100),
  subpart VARCHAR(100)
);
insert into  assembly  values('trike','wheel');
insert into  assembly  values('trike','frame');
insert into  assembly  values('frame','seat');
insert into  assembly  values('frame','pedal');
insert into  assembly  values('wheel','spoke');
insert into  assembly  values('wheel','tire');
insert into  assembly  values('tire','rim');
insert into  assembly  values('tire','tube');

 * mysql://stu2000013095:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [162]:
%%sql
desc assembly;
select * from assembly;

 * mysql://stu2000013095:***@162.105.146.37:43306
2 rows affected.
8 rows affected.

[('trike', 'wheel'),
 ('trike', 'frame'),
 ('frame', 'seat'),
 ('frame', 'pedal'),
 ('wheel', 'spoke'),
 ('wheel', 'tire'),
 ('tire', 'rim'),
 ('tire', 'tube')]

展示某个节点对应的子节点，其中“.”个数表明之间的节点个数

In [163]:
%%sql
with recursive assembly_tree AS (
  select part, subpart, 1 AS level, concat(part, '.', subpart) as path
  from assembly
  where part = 'trike'
  union all
  select a.part, a.subpart, at.level + 1, concat(at.path, '.', a.subpart)
  from assembly a
  join assembly_tree at on a.part = at.subpart
)
select concat(
  repeat('.', at.level - 1),
  substring_index(at.path, '.', -1)
) as tree_structure
from assembly_tree at
order by at.path;

 * mysql://stu2000013095:***@162.105.146.37:43306
8 rows affected.

[('frame',),
 ('.pedal',),
 ('.seat',),
 ('wheel',),
 ('.spoke',),
 ('.tire',),
 ('..rim',),
 ('..tube',)]

In [164]:
%%sql
with recursive assembly_tree AS (
  select part, subpart, 1 AS level, concat(part, '.', subpart) as path
  from assembly
  where part = 'trike'
  union all
  select a.part, a.subpart, at.level + 1, concat(at.path, '.', a.subpart)
  from assembly a
  join assembly_tree at on a.part = at.subpart
)
select * from assembly_tree

 * mysql://stu2000013095:***@162.105.146.37:43306
8 rows affected.

[('trike', 'wheel', 1, 'trike.wheel'),
 ('trike', 'frame', 1, 'trike.frame'),
 ('frame', 'seat', 2, 'trike.frame.seat'),
 ('frame', 'pedal', 2, 'trike.frame.pedal'),
 ('wheel', 'spoke', 2, 'trike.wheel.spoke'),
 ('wheel', 'tire', 2, 'trike.wheel.tire'),
 ('tire', 'rim', 3, 'trike.wheel.tire.rim'),
 ('tire', 'tube', 3, 'trike.wheel.tire.tube')]

In [165]:
%%sql
with recursive assembly_cte (part, subpart, level) as (
  select part, subpart, 1
  from assembly
  where part = 'trike'
  union all
  select a.part, a.subpart, cte.level + 1
  from assembly a
  inner join assembly_cte cte on a.part = cte.subpart
)
select 
    json_object(
        main.part,
       (
            select json_arrayagg(
                json_object(
                    sub.subpart,
                    (
                        select json_arrayagg(
                            json_object(
                                subsub.subpart,(
                                    select json_arrayagg(subsubsub.subpart)
                                    from assembly_cte subsubsub
                                    where subsubsub.part=subsub.subpart
                                )
                            )
                            
                        )
                        from assembly_cte subsub
                        where subsub.part=sub.subpart
                    )
                ))
            from assembly_cte sub
            where sub.part = main.part
        )
    )
as json_output
from assembly_cte main WHERE main.level = 1
order by main.level
limit 1

 * mysql://stu2000013095:***@162.105.146.37:43306
1 rows affected.

[('{"trike": [{"wheel": [{"spoke": null}, {"tire": ["rim", "tube"]}]}, {"frame": [{"seat": null}, {"pedal": null}]}]}',)]